{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group2-shard1of1.bin"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group3-shard1of1.bin"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group4-shard1of1.bin"], "weights": [{"name": "batch_normalization_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group5-shard1of1.bin"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of1.bin"], "weights": [{"name": "batch_normalization_3/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group7-shard1of1.bin"], "weights": [{"name": "conv2d_4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group8-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group9-shard1of1.bin"], "weights": [{"name": "conv2d_5/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group10-shard1of1.bin"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of1.bin"], "weights": [{"name": "conv2d_6/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group12-shard1of1.bin"], "weights": [{"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group13-shard1of1.bin"], "weights": [{"name": "conv2d_7/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group14-shard1of1.bin"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group15-shard1of1.bin"], "weights": [{"name": "conv2d_8/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group16-shard1of1.bin"], "weights": [{"name": "batch_normalization_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group17-shard1of1.bin"], "weights": [{"name": "conv2d_9/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group18-shard1of1.bin"], "weights": [{"name": "batch_normalization_9/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group19-shard1of1.bin"], "weights": [{"name": "conv2d_10/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group20-shard1of1.bin"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group21-shard1of1.bin"], "weights": [{"name": "conv2d_11/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group22-shard1of1.bin"], "weights": [{"name": "batch_normalization_11/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group23-shard1of1.bin"], "weights": [{"name": "conv2d_12/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group24-shard1of1.bin"], "weights": [{"name": "batch_normalization_12/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group25-shard1of1.bin"], "weights": [{"name": "conv2d_13/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group26-shard1of1.bin"], "weights": [{"name": "batch_normalization_13/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group27-shard1of1.bin"], "weights": [{"name": "conv2d_14/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group28-shard1of1.bin"], "weights": [{"name": "batch_normalization_14/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group29-shard1of1.bin"], "weights": [{"name": "conv2d_15/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group30-shard1of1.bin"], "weights": [{"name": "batch_normalization_15/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group31-shard1of1.bin"], "weights": [{"name": "conv2d_16/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group32-shard1of1.bin"], "weights": [{"name": "batch_normalization_16/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group33-shard1of1.bin"], "weights": [{"name": "conv2d_17/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group34-shard1of1.bin"], "weights": [{"name": "batch_normalization_17/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group35-shard1of1.bin"], "weights": [{"name": "conv2d_18/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group36-shard1of1.bin"], "weights": [{"name": "batch_normalization_18/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group37-shard1of1.bin"], "weights": [{"name": "conv2d_19/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group38-shard1of1.bin"], "weights": [{"name": "batch_normalization_19/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group39-shard1of1.bin"], "weights": [{"name": "conv2d_20/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_20/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group40-shard1of1.bin"], "weights": [{"name": "batch_normalization_20/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group41-shard1of1.bin"], "weights": [{"name": "conv2d_21/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group42-shard1of1.bin"], "weights": [{"name": "batch_normalization_21/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group43-shard1of1.bin"], "weights": [{"name": "conv2d_22/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group44-shard1of1.bin"], "weights": [{"name": "batch_normalization_22/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group45-shard1of1.bin"], "weights": [{"name": "conv2d_23/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group46-shard1of1.bin"], "weights": [{"name": "batch_normalization_23/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group47-shard1of1.bin"], "weights": [{"name": "conv2d_24/kernel", "shape": [7, 7, 64, 3], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [3], "dtype": "float32"}]}]}